"""
座右铭:心不狠，站不稳！欧耶！
@project:8_6
@author:Mr.Zhou
@file:URL简介.PY
@ide:PyCharm
@time:2018-08-06 09:03:05
"""
# 1、什么是url
# URL（统一资源占位符）也就是我们通常说的网址。统一资源占位符是对可以从互联网上得到的资源的位置和访问的一种简洁的标识，是互联网上标准资源的地址

# http://www.yundama.com/resources/css/global.css
# 1、URL的组成部分：
# 第一部分协议：（或者叫做服务方式http/https）
# 第二部分是存有资源的主机IP地址（有时候也会包括端口号）
# 第三部分是主机资源的具体地址，如目录或者文件名等。

# URL的完整格式：
# 1、协议（http/https/ftp等等）
# 2、服务器的IP地址或者域名。
# 3、服务器的端口号（80，8080等等）
# 4、访问资源的路径
# 5、参数，发送给http服务器的数据。

# 端口：一台服务器IP地址的主句可以提供很多种服务，比如说web服务，ftp服务，smtp服务。那么主机数怎么样区别这些服务的呢？为了区别这些服务，于是便通过IP地址+端口号来区别不同的服务。

# 常用的端口号（常识，必须会）：
# http端口号：80
# https端口号：443
# 邮箱的端口号：25
# 数据库的端口号：3306
# 微信的端口号：80




















